/*
198. 打家劫舍
你是一个专业的小偷，计划偷窃沿街的房屋。每间房内都藏有一定的现金，影响你偷窃的唯一制约因素就是相邻的房屋装有相互连通的防盗系统，如果两间相邻的房屋在同一晚上被小偷闯入，系统会自动报警。
给定一个代表每个房屋存放金额的非负整数数组，计算你 不触动警报装置的情况下 ，一夜之内能够偷窃到的最高金额。

示例 1：
输入：[1,2,3,1]
输出：4
解释：偷窃 1 号房屋 (金额 = 1) ，然后偷窃 3 号房屋 (金额 = 3)。
     偷窃到的最高金额 = 1 + 3 = 4 。
     
示例 2：
输入：[2,7,9,3,1]
输出：12
解释：偷窃 1 号房屋 (金额 = 2), 偷窃 3 号房屋 (金额 = 9)，接着偷窃 5 号房屋 (金额 = 1)。
     偷窃到的最高金额 = 2 + 9 + 1 = 12 。

提示：
1 <= nums.length <= 100
0 <= nums[i] <= 400

*/

// 动态规划问题，一个房间偷不偷取决去上一个房间不偷以及上上个房间不偷。初始化数组dp[nums.length + 1],dp[0] = 0 ,dp[1] = nums[0],
// 数组中第一个表示不偷第一个房间，数组中第一个表示偷第一个房间，接着从动态数组的第三个数开始遍历，动态数组减一表示原数组（即从原数组中第二个数开始遍历）。选择不选择当前数取决于当前数组的前一个数偷不偷
// 若偷了前一个房间，则该房间不偷，因此，动态数组第三个数取决于原数组中第一个数和第二个数哪个大。即后续遍历到的原数组偷不偷取决于偷前一个房间的最大值和不偷前一个房间的最大值。


    public static void main(String[] args) {
        int[] nums = {2,1,1,2};
        System.out.println(rob(nums));

    }

    public static int rob(int[] nums) {
        if (nums.length == 0) {
            return 0;
        }
        // 子问题：
        // f(k) = 偷 [0..k) 房间中的最大金额

        // f(0) = 0
        // f(1) = nums[0]
        // f(k) = max{ rob(k-1), nums[k-1] + rob(k-2) }

        int N = nums.length;
        int[] dp = new int[N+1];
        dp[0] = 0;
        dp[1] = nums[0];
        for (int k = 2; k <= N; k++) {
            dp[k] = Math.max(dp[k-1], nums[k-1] + dp[k-2]);
        }
        return dp[N];
    }
